sample-xml/subscribe/subscribe.xml

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><ns1:SessionHeader xmlns:ns1="http://api.zuora.com/" soapenv:mustUnderstand="0"><ns1:session>iU9lwebTCcHbQhKvM1jUxMDYHE5c+Muxs6aEf3iXASL05aE/zABD6aNEBV2ZzM8LNpi9sKNZFGWp1xf6dnmrEVNPoTPeqfygxaXeLHZ16XsXo7Tys5E9uA==</ns1:session></ns1:SessionHeader></soapenv:Header><soapenv:Body><ns1:subscribe xmlns:ns1="http://api.zuora.com/"><ns1:subscribes><ns1:Account xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:Account"><ns2:AccountNumber>t-1230661730921</ns2:AccountNumber><ns2:AllowInvoiceEdit>true</ns2:AllowInvoiceEdit><ns2:AutoPay>false</ns2:AutoPay><ns2:Batch>Batch1</ns2:Batch><ns2:BillCycleDay>1</ns2:BillCycleDay><ns2:CrmId>SFDC-1230661730921</ns2:CrmId><ns2:Currency>USD</ns2:Currency><ns2:CustomerServiceRepName>CSR Dude</ns2:CustomerServiceRepName><ns2:Name>SomeAccount1230661730921</ns2:Name><ns2:PaymentTerm>Due Upon Receipt</ns2:PaymentTerm><ns2:PurchaseOrderNumber>PO-1230661730921</ns2:PurchaseOrderNumber><ns2:SalesRepName>Sales Dude</ns2:SalesRepName><ns2:Status>Draft</ns2:Status></ns1:Account><ns1:PaymentMethod xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:PaymentMethod"><ns2:CreditCardAddress1>52 Vexford Lane</ns2:CreditCardAddress1><ns2:CreditCardCity>Anaheim</ns2:CreditCardCity><ns2:CreditCardCountry>United States</ns2:CreditCardCountry><ns2:CreditCardExpirationMonth>1</ns2:CreditCardExpirationMonth><ns2:CreditCardExpirationYear>2009</ns2:CreditCardExpirationYear><ns2:CreditCardHolderName>Firstly Lastly</ns2:CreditCardHolderName><ns2:CreditCardNumber>4959911773775979</ns2:CreditCardNumber><ns2:CreditCardPostalCode>92808</ns2:CreditCardPostalCode><ns2:CreditCardState>California</ns2:CreditCardState><ns2:CreditCardType>Visa</ns2:CreditCardType><ns2:Type>CreditCard</ns2:Type></ns1:PaymentMethod><ns1:BillToContact xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:Contact"><ns2:Address1>52 Vexford Lane</ns2:Address1><ns2:City>Anaheim</ns2:City><ns2:Country>United States</ns2:Country><ns2:FirstName>Firstly1230661733359</ns2:FirstName><ns2:LastName>Secondly1230661733359</ns2:LastName><ns2:PostalCode>92808</ns2:PostalCode><ns2:State>California</ns2:State><ns2:WorkEmail>contact@test.com</ns2:WorkEmail><ns2:WorkPhone>4152225151</ns2:WorkPhone></ns1:BillToContact><ns1:SubscribeOptions><ns1:GenerateInvoice>false</ns1:GenerateInvoice><ns1:ProcessPayments>false</ns1:ProcessPayments></ns1:SubscribeOptions><ns1:SubscriptionData><ns1:Subscription xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:Subscription"><ns2:AutoRenew>false</ns2:AutoRenew><ns2:ContractAcceptanceDate>2008-12-30T10:28:53.359-08:00</ns2:ContractAcceptanceDate><ns2:ContractEffectiveDate>2008-12-30T10:28:53.359-08:00</ns2:ContractEffectiveDate><ns2:InitialTerm>12</ns2:InitialTerm><ns2:Name>SomeSubscription1230661733359</ns2:Name><ns2:RenewalTerm>12</ns2:RenewalTerm><ns2:ServiceActivationDate>2008-12-30T10:28:53.359-08:00</ns2:ServiceActivationDate><ns2:TermStartDate>2008-12-30T10:28:53.359-08:00</ns2:TermStartDate><ns2:Version>1</ns2:Version></ns1:Subscription><ns1:RatePlanData><ns1:RatePlan xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:RatePlan"><ns2:ProductRatePlanId>402828d31e89279a011e8927c3630037</ns2:ProductRatePlanId></ns1:RatePlan><ns1:RatePlanCharge xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:RatePlanCharge"><ns2:Id>402828d31e89279a011e8927c690003a</ns2:Id><ns2:Name>charge1230661731671</ns2:Name><ns2:ProductRatePlanChargeId>402828d31e89279a011e8927c690003a</ns2:ProductRatePlanChargeId></ns1:RatePlanCharge></ns1:RatePlanData></ns1:SubscriptionData></ns1:subscribes></ns1:subscribe></soapenv:Body></soapenv:Envelope>